#pragma once

#include "UniDxDefine.h"


// -----------------------------------------------------------------------------
// 頂点シェーダー側と共有する、モデルビュー行列の定数バッファ
//     UniDxではすべてのシェーダーでスロット0番に共通で指定する
// -----------------------------------------------------------------------------
struct VSConstantBuffer0
{
    Matrix world;
    Matrix view;
    Matrix projection;
};


// -----------------------------------------------------------------------------
// 頂点シェーダー側と共有する、マテリアルの定数バッファ
//     UniDxではすべてのシェーダーでスロット1番に共通で指定する
// -----------------------------------------------------------------------------
struct VSConstantBuffer1
{
    Color baseColor;
};
